artillery/loadTest.yml
config:
  target: "https://1000and1songs.com/#/"
  phases:
    - duration: 10  
      arrivalRate: 1000  
      name: "Initial Load Test"
    - duration: 10
      arrivalRate: 2000
      rampTo: 3000  
      name: "Ramp Up Load Test"
  defaults:
    headers:
      User-Agent: "Artillery"
  capture:
    response:
      - json: $.metadata.response_time
        as: "response_time"
scenarios:
  - name: "Getting Resources"
    flow:
      - get:
          url: "{{ target }}get"
          headers:
            Accept: "application/json"
      - think: 5  

  - name: "Posting Data"
    flow:
      - post:
          url: "{{ target }}post"
          headers:
            Content-Type: "application/json"
          json:
            key1: "value1"
            key2: "value2"
      - think: 3

  - name: "Mixed Operations"
    flow:
      - get:
          url: "{{ target }}resources"
      - post:
          url: "{{ target }}submit"
          headers:
            Content-Type: "application/json"
          json:
            name: "Test User"
            age: 30
      - think: 2
      - get:
          url: "{{ target }}status"

  - name: "Error Handling"
    flow:
      - get:
          url: "{{ target }}nonexistent"
        capture:
          - json: "$.error"
            as: "error_message"
      - log: "Handled error: {{ error_message }}"